import 'package:hive/hive.dart';
import 'package:second_copy_for_azkar_application/model/theker.dart';
import 'package:second_copy_for_azkar_application/model/thekerheader.dart';

void addTheker(Theker theker) async {
  await Hive.box<Theker>('thekers').add(theker);
}

void addThekerHeader(ThekerHeader thekerHeader) async {
  var box = Hive.box<ThekerHeader>('thekerHeaders');
  await box.add(thekerHeader);
}

List<ThekerHeader> getThekerHeaders() {
  return Hive.box<ThekerHeader>('thekerHeaders').values.toList();
}

List<Theker> getThekers(String thekerHeader) {
  return Hive.box<Theker>('thekers')
      .values
      .where((element) => element.theker_header == thekerHeader)
      .toList();
}

List<Theker> getAllThekers() {
  return Hive.box<Theker>('thekers').values.toList();
}

void addThekers() {
    if (getThekerHeaders().isEmpty && getAllThekers().isEmpty) {
      print('MAIN data begin add now!');
      addThekerHeader(ThekerHeader(text: 'أذكار الصباح'));
      addThekerHeader(ThekerHeader(text: 'أذكار المساء'));
      addThekerHeader(ThekerHeader(text: 'أذكار بعد الصلاة'));
      addThekerHeader(ThekerHeader(text: 'أذكار النوم'));
      addThekerHeader(ThekerHeader(text: 'أذكار الاستيقاظ'));
      if (getAllThekers().isEmpty) {
        print('MAIN theker data begin add now!');
// أذكار الصباح
        addTheker(
          Theker(
            theker_text: 'سبحان الله وبحمده',
            theker_reward:
                'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
            theker_number: 100,
            theker_guide:
                'عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي : سُبْحَانَ اللهِ وَبِحَمْدِهِ ، مِائَةَ مَرَّةٍ ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ ، بِأَفْضَلَ مِمَّا جَاءَ بِهِ ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ ، أَوْ زَادَ عَلَيْهِ ) .',
            theker_header: 'أذكار الصباح',
          ),
        );
        addTheker(
          Theker(
            theker_text:
                'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
            theker_number: 1,
            theker_reward: '',
            theker_guide: '''
      عن ابن مسعود قَالَ : كَانَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، إِذَا أَمْسَى قَالَ : ( أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ ، وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ ) .
وَإِذَا أَصْبَحَ قَالَ ذَلِكَ أَيْضًا : ( أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ) .
      ''',
            theker_header: 'أذكار الصباح',
          ),
        );
        addTheker(
          Theker(
              theker_text:
                  'اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
              theker_guide:
                  'عن شَدَّاد بْن أَوْسٍ رَضِيَ اللَّهُ عَنْهُ: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ : اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ) .',
              theker_reward:
                  'مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا ، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا ، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ',
              theker_header: 'أذكار الصباح',
              theker_number: 1),
        );
        addTheker(
          Theker(
            theker_text:
                'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
            theker_reward:
                'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ',
            theker_guide:
                'عن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ ) .',
            theker_number: 3,
            theker_header: 'أذكار الصباح',
          ),
        );
        addTheker(
          Theker(
              theker_text:
                  'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ',
              theker_number: 3,
              theker_reward:
                  'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
              theker_guide:
                  'عن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ ) .',
              theker_header: 'أذكار الصباح'),
        );
        addTheker(
          Theker(
              theker_text:
                  'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ',
              theker_reward:
                  'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
              theker_number: 3,
              theker_guide:
                  'عن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ ) .',
              theker_header: 'أذكار الصباح'),
        );
        addTheker(
          Theker(
              theker_text:
                  'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.',
              theker_number: 1,
              theker_reward: '',
              theker_guide:
                  'عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ : ( اللهُمَّ بِكَ أَصْبَحْنَا ، وَبِكَ أَمْسَيْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ النُّشُورُ ) وَإِذَا أَمْسَى قَالَ : ( اللَّهُمَّ بِكَ أَمْسَيْنَا ، وَبِكَ أَصْبَحْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ الْمَصِيرُ ) .',
              theker_header: 'أذكار الصباح'),
        );
        addTheker(
          Theker(
            theker_text:
                'اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ',
            theker_number: 1,
            theker_reward: '',
            theker_guide:
                ' عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ قَالَ : أَتَيْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ، فَقُلْتُ لَهُ : حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً ، فَقَالَ : هَذَا مَا كَتَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا : أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ( يَا أَبَا بَكْرٍ ، قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ ) .',
            theker_header: 'أذكار الصباح',
          ),
        );
        addTheker(
          Theker(
              theker_text:
                  'بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ',
              theker_reward: 'لَمْ يَضُرَّهُ شَيْءٌ',
              theker_guide:
                  'عن عثمان بن عفان رضي الله عنه قال : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : ( مَنْ قَالَ : بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ ) .',
              theker_header: 'أذكار الصباح',
              theker_number: 3),
        );
        addTheker(
          Theker(
            theker_text:
                'رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا',
            theker_number: 3,
            theker_reward:
                'كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ',
            theker_guide:
                'عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ، إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ )',
            theker_header: 'أذكار الصباح',
          ),
        );
        addTheker(Theker(
          theker_text:
              'اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. ',
          theker_number: 1,
          theker_reward: 'أدى شكر يومه.',
          theker_guide:
              'جاء من حديث عبدالله بن غنام البياضي : أنَّ رسول الله ﷺ قال: مَن قال حين يُصبح: اللهم ما أصبح بي من نعمةٍ فمنك وحدك، لا شريكَ لك، فلك الحمد، ولك الشُّكر؛ فقد أدَّى شُكره يومه، ومَن قال مثل ذلك حين يُمسي فقد أدَّى شُكر ليلته[1].',
          theker_header: 'أذكار الصباح',
        ));
        addTheker(
          Theker(
            theker_text:
                'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
            theker_reward: 'من قالها أعتقه الله من النار.',
            theker_number: 4,
            theker_header: 'أذكار الصباح',
            theker_guide:
                'عن أنس بن مالك -رضي الله عنه- يقول: إن رسول الله -صلى الله عليه وسلم- قال: من قال حين يصبح: اللهم أصبحنا نشهدك ونشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله، لا إله إلا أنت وحدك لا شريك لك، وأن محمدًا عبدك ورسولك، إلا غفر الله له ما أصاب في يومه ذلك، وإن قالها حين يمسي غفر الله له ما أصاب في تلك الليلة من ذنب.',
          ),
        );
        addTheker(Theker(
          theker_text:
              'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ، اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. ',
          theker_number: 3,
          theker_reward: '',
          theker_guide:
              ' عن عبدالرحمن ابن أبي بكرة: أنه قال لأبيه : أيا أبه، إني أسمعك تدعو كلَّ غداةٍ: (اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت) ثلاثًا حين تُصبح، وثلاثًا حين تُمسي، وتقول: (اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر)، تُعيدها ثلاثًا حين تُصبح، وثلاثًا حين تُمسي؟ قال: نعم، يا بني، إني سمعتُ رسولَ الله ﷺ يدعو بهنَّ، فأنا أُحبُّ أن أستنَّ بسُنَّ.',
          theker_header: 'أذكار الصباح',
        ));
        addTheker(Theker(
          theker_text:
              'أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
          theker_number: 1,
          theker_reward: '',
          theker_guide:
              'عن عبدالله بن عبدالرحمن بن أبزى، عن أبيه -رضي الله عنهما- قال: كان النبيُّ ﷺ إذا أصبح قال: أصبحنا على فطرة الإسلام، وكلمة الإخلاص، ودين نبينا محمدٍ ﷺ، وملّة أبينا إبراهيم حنيفًا مسلمًا',
          theker_header: 'أذكار الصباح',
        ));
        addTheker(Theker(
          theker_text:
              'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ',
          theker_number: 1,
          theker_reward: '',
          theker_guide:
              'عن ابْن عُمَرَ ، قال : لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ ، حِينَ يُمْسِي ، وَحِينَ يُصْبِحُ : ( اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ) .',
          theker_header: 'أذكار الصباح',
        ));
        addTheker(Theker(
            theker_text:
                ' لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
            theker_reward:
                ' كَانَ لَهُ عِدْلَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ، وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ، وَحُطَّ عَنْهُ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ، وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ',
            theker_guide:
                'عَنْ أَبِي عَيَّاشٍ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: ( مَنْ قَالَ إِذَا أَصْبَحَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، كَانَ لَهُ عِدْلَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ، وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ، وَحُطَّ عَنْهُ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ، وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ، وَإِنْ قَالَهَا إِذَا أَمْسَى كَانَ لَهُ مِثْلُ ذَلِكَ حَتَّى يُصْبِحَ ) .',
            theker_header: 'أذكار الصباح',
            theker_number: 10));
        addTheker(Theker(
          theker_text:
              ' لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
          theker_number: 100,
          theker_reward:
              ' كَانَ لَهُ عِدْلَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ، وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ، وَحُطَّ عَنْهُ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ، وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ',
          theker_guide:
              'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : ( مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، فِي يَوْمٍ مِائَةَ مَرَّةٍ ؛ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ ، وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ ، وَكَانَتْ لَهُ حِرْزًا مِنْ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ ، إِلَّا رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ ) .',
          theker_header: 'أذكار الصباح',
        ));
// أذكار المساء
        addTheker(
          Theker(
            theker_text: 'سبحان الله وبحمده',
            theker_reward:
                'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
            theker_number: 100,
            theker_guide:
                'عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي : سُبْحَانَ اللهِ وَبِحَمْدِهِ ، مِائَةَ مَرَّةٍ ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ ، بِأَفْضَلَ مِمَّا جَاءَ بِهِ ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ ، أَوْ زَادَ عَلَيْهِ ) .',
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(
          Theker(
            theker_text:
                'أَمسَيْنَا وأَمسَى المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذه الليلة وَخَـيرَ ما بَعْـدَها ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذه الليلة وَشَرِّ ما بَعْـدَها، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
            theker_number: 1,
            theker_reward: '',
            theker_guide: '''عن ابن مسعود قَالَ : كَانَ نَبِيُّ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، إِذَا أَمْسَى قَالَ : ( أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ ، وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ ) .
وَإِذَا أَصْبَحَ قَالَ ذَلِكَ أَيْضًا : ( أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ) .
      ''',
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(
          Theker(
              theker_text:
                  'اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ',
              theker_guide:
                  'عن شَدَّاد بْن أَوْسٍ رَضِيَ اللَّهُ عَنْهُ: عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ : اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْت َ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي ، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ) .',
              theker_reward:
                  'مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا ، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا ، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ',
              theker_header: 'أذكار المساء',
              theker_number: 1),
        );
        addTheker(
          Theker(
            theker_text:
                'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
            theker_reward:
                'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ',
            theker_guide:
                'عن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ ) .',
            theker_number: 3,
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(
          Theker(
            theker_text:
                'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ',
            theker_number: 3,
            theker_reward:
                'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
            theker_guide:
                'عن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ ) .',
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(
          Theker(
            theker_text:
                'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ',
            theker_reward:
                'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
            theker_number: 3,
            theker_guide:
                'عن عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ ) .',
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(
          Theker(
            theker_text:
                'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.',
            theker_number: 1,
            theker_reward: '',
            theker_guide:
                'عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ : ( اللهُمَّ بِكَ أَصْبَحْنَا ، وَبِكَ أَمْسَيْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ النُّشُورُ ) وَإِذَا أَمْسَى قَالَ : ( اللَّهُمَّ بِكَ أَمْسَيْنَا ، وَبِكَ أَصْبَحْنَا ، وَبِكَ نَحْيَا ، وَبِكَ نَمُوتُ ، وَإِلَيْكَ الْمَصِيرُ ) .',
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(
          Theker(
            theker_text:
                'اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ',
            theker_number: 1,
            theker_reward: '',
            theker_guide:
                ' عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ قَالَ : أَتَيْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ، فَقُلْتُ لَهُ : حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً ، فَقَالَ : هَذَا مَا كَتَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ . فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا : أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ( يَا أَبَا بَكْرٍ ، قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ ) .',
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(
          Theker(
              theker_text:
                  'بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ',
              theker_reward: 'لَمْ يَضُرَّهُ شَيْءٌ',
              theker_guide:
                  'عن عثمان بن عفان رضي الله عنه قال : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : ( مَنْ قَالَ : بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُصْبِحَ ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ ) .',
              theker_header: 'أذكار المساء',
              theker_number: 3),
        );
        addTheker(
          Theker(
            theker_text:
                'رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا',
            theker_number: 3,
            theker_reward:
                'كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ',
            theker_guide:
                'عن خَادِم النَّبِيِّ، صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : ( مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ : رَضِيتُ بِاللهِ رَبًّا ، وَبِالْإِسْلَامِ دِينًا ، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ، إِلَّا كَانَ حَقًّا عَلَى اللهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ )',
            theker_header: 'أذكار المساء',
          ),
        );
        addTheker(Theker(
          theker_text:
              'اللّهُـمَّ ما أَمسَى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. ',
          theker_number: 1,
          theker_reward: 'أدى شكر يومه.',
          theker_guide:
              'جاء من حديث عبدالله بن غنام البياضي : أنَّ رسول الله ﷺ قال: مَن قال حين يُصبح: اللهم ما أصبح بي من نعمةٍ فمنك وحدك، لا شريكَ لك، فلك الحمد، ولك الشُّكر؛ فقد أدَّى شُكره يومه، ومَن قال مثل ذلك حين يُمسي فقد أدَّى شُكر ليلته[1].',
          theker_header: 'أذكار المساء',
        ));
        addTheker(
          Theker(
            theker_text:
                'اللّهُـمَّ إِنِّـي أَمسَيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
            theker_reward: 'من قالها أعتقه الله من النار.',
            theker_number: 4,
            theker_header: 'أذكار المساء',
            theker_guide:
                'عن أنس بن مالك -رضي الله عنه- يقول: إن رسول الله -صلى الله عليه وسلم- قال: من قال حين يصبح: اللهم أصبحنا نشهدك ونشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله، لا إله إلا أنت وحدك لا شريك لك، وأن محمدًا عبدك ورسولك، إلا غفر الله له ما أصاب في يومه ذلك، وإن قالها حين يمسي غفر الله له ما أصاب في تلك الليلة من ذنب.',
          ),
        );
        addTheker(Theker(
          theker_text:
              'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ، اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ. ',
          theker_number: 3,
          theker_reward: '',
          theker_guide:
              ' عن عبدالرحمن ابن أبي بكرة: أنه قال لأبيه : أيا أبه، إني أسمعك تدعو كلَّ غداةٍ: (اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت) ثلاثًا حين تُصبح، وثلاثًا حين تُمسي، وتقول: (اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر)، تُعيدها ثلاثًا حين تُصبح، وثلاثًا حين تُمسي؟ قال: نعم، يا بني، إني سمعتُ رسولَ الله ﷺ يدعو بهنَّ، فأنا أُحبُّ أن أستنَّ بسُنَّ.',
          theker_header: 'أذكار المساء',
        ));
        addTheker(Theker(
          theker_text:
              'أَمسَينا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
          theker_number: 1,
          theker_reward: '',
          theker_guide:
              'عن عبدالله بن عبدالرحمن بن أبزى، عن أبيه -رضي الله عنهما- قال: كان النبيُّ ﷺ إذا أصبح قال: أصبحنا على فطرة الإسلام، وكلمة الإخلاص، ودين نبينا محمدٍ ﷺ، وملّة أبينا إبراهيم حنيفًا مسلمًا',
          theker_header: 'أذكار المساء',
        ));
        addTheker(Theker(
          theker_text:
              'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ',
          theker_number: 1,
          theker_reward: '',
          theker_guide:
              'عن ابْن عُمَرَ ، قال : لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ ، حِينَ يُمْسِي ، وَحِينَ يُصْبِحُ : ( اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي ، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ ، وَمِنْ خَلْفِي ، وَعَنْ يَمِينِي ، وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ) .',
          theker_header: 'أذكار المساء',
        ));
        addTheker(Theker(
            theker_text:
                ' لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
            theker_reward:
                ' كَانَ لَهُ عِدْلَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ، وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ، وَحُطَّ عَنْهُ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ، وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ',
            theker_guide:
                'عَنْ أَبِي عَيَّاشٍ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: ( مَنْ قَالَ إِذَا أَصْبَحَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، كَانَ لَهُ عِدْلَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ، وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ، وَحُطَّ عَنْهُ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ، وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ، وَإِنْ قَالَهَا إِذَا أَمْسَى كَانَ لَهُ مِثْلُ ذَلِكَ حَتَّى يُصْبِحَ ) .',
            theker_header: 'أذكار المساء',
            theker_number: 10));
        addTheker(
          Theker(
            theker_text: 'أعوذ بكلمات الله التامات من شر ما خلق',
            theker_reward: 'َلَم يَضُرَّهُ شَيءٌ',
            theker_guide:
                'أن النبي ﷺ قال: مَن قال: أعوذ بكلمات الله التامَّات من شرِّ ما خلق؛ لم يضرّه شيءٌ، وجاء رجلٌ فقال: يا رسول الله، ما لقيتُ البارحة من عقربٍ لدغتني؟! قال: أما إنَّك لو قلتَ: أعوذ بكلمات الله التامَّات من شرِّ ما خلق؛ لم تضرّك،',
            theker_header: 'أذكار المساء',
            theker_number: 3,
          ),
        );
        addTheker(
          Theker(
            theker_text:
                ' لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ',
            theker_number: 100,
            theker_reward:
                ' كَانَ لَهُ عِدْلَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ، وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ، وَحُطَّ عَنْهُ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ، وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ',
            theker_guide:
                'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : ( مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، فِي يَوْمٍ مِائَةَ مَرَّةٍ ؛ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ ، وَكُتِبَ لَهُ مِائَةُ حَسَنَةٍ ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ ، وَكَانَتْ لَهُ حِرْزًا مِنْ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ ، إِلَّا رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ ) .',
            theker_header: 'أذكار المساء',
          ),
        );

// أذكار بعد الصلاة
        addTheker(Theker(
            theker_text: '''
أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.
اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .''',
            theker_number: 1,
            theker_reward: '',
            theker_guide:
                'كانَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ، إذَا انْصَرَفَ مِن صَلَاتِهِ اسْتَغْفَرَ ثَلَاثًا وَقالَ: اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ ذَا الجَلَالِ وَالإِكْرَامِ. ',
            theker_header: 'أذكار بعد الصلاة'));
        addTheker(Theker(
          theker_text:
              '''سُـبْحانَ اللهِ(33) الحمدلله(33) الله أكبر (33) ، ويقول تمام المائة لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو كل شيء قدير''',
          theker_reward: 'غفرت له خطاياه وإن كانت مثل زبد البحر',
          theker_number: 33,
          theker_guide:
              'حديث أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : " مَنْ سَبَّحَ اللَّهَ فِي دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وَثَلاثِينَ وَحَمِدَ اللَّهَ ثَلاثًا وَثَلاثِينَ وَكَبَّرَ اللَّهَ ثَلاثًا وَثَلاثِينَ فَتْلِكَ تِسْعَةٌ وَتِسْعُونَ وَقَالَ تَمَامَ الْمِائَةِ لا إِلَهَ إِلاّ اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ غُفِرَتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ . "',
          theker_header: 'أذكار بعد الصلاة',
        ));
        addTheker(Theker(
            theker_text: '''
لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، لا حول ولا قوة إلا بالله، لا إله إلا الله، ولا نعبد إلا إياه، له النعمة وله الفضل وله الثناء الحسن، لا إله إلا الله، مخلصين له الدين ولو كره الكافرون. 
''',
            theker_number: 1,
            theker_reward: '',
            theker_guide:
                'عن أبي الزبير قال: كان ابن الزبير يقول في دبر كل صلاة حين يسلم: لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير، لا حول ولا قوة إلا بالله، لا إله إلا الله، ولا نعبد إلا إياه، له النعمة وله الفضل وله الثناء الحسن، لا إله إلا الله، مخلصين له الدين ولو كره الكافرون. وقال: كان رسول الله صلى الله عليه وسلم يهلل بهن دبر كل صلاة.',
            theker_header: 'أذكار بعد الصلاة'));
        addTheker(Theker(
            theker_text: '''
لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد ''',
            theker_number: 1,
            theker_reward: '',
            theker_guide:
                'إنَّ نَبِيَّ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ كانَ يقولُ في دُبُرِ كُلِّ صَلَاةٍ: لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ، وله الحَمْدُ، وهو علَى كُلِّ شيءٍ قَدِيرٌ، اللَّهُمَّ لا مَانِعَ لِما أعْطَيْتَ، ولَا مُعْطِيَ لِما مَنَعْتَ، ولَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ ',
            theker_header: 'أذكار بعد الصلاة'));
        addTheker(
          Theker(
            theker_text:
                '''اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.''',
            theker_guide:
                'عن علي ـ رضي الله عنه ـ قال: سمعت نبيكم صلى الله عليه وسلم يقول وهو على أعواد المنبر: من قرأ آية الكرسي دبر كل صلاة لم يمنعه من دخول الجنة إلا الموت،',
            theker_header: 'أذكار بعد الصلاة',
            theker_number: 1,
            theker_reward: 'لم يمنعه من دخول الجنة إلا أن يموت',
          ),
        );
        addTheker(Theker(
          theker_text:
              '''قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.''',
          theker_number: 3,
          theker_reward:
              'ثلاث مرات بعد صلاتي الفجروالمغرب، ومرة بعد الصلوات الأخرى',
          theker_guide:
              ' حديث عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ )',
          theker_header: 'أذكار بعد الصلاة',
        ));
        addTheker(Theker(
          theker_text:
              '''قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ..''',
          theker_number: 3,
          theker_reward:
              'ثلاث مرات بعد صلاتي الفجروالمغرب، ومرة بعد الصلوات الأخرى',
          theker_guide:
              ' حديث عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ )',
          theker_header: 'أذكار بعد الصلاة',
        ));
        addTheker(Theker(
          theker_text:
              '''قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.''',
          theker_number: 3,
          theker_reward:
              'ثلاث مرات بعد صلاتي الفجروالمغرب، ومرة بعد الصلوات الأخرى',
          theker_guide:
              ' حديث عبد الله بن خبيب رضي الله عنه أن النبي صلى الله عليه وسلم قال له : ( قُلْ : " قُلْ هُوَ اللَّهُ أَحَدٌ " ، وَالمُعَوِّذَتَيْنِ ، حِينَ تُمْسِي وَتُصْبِحُ ثَلاَثَ مَرَّاتٍ ، تَكْفِيكَ مِنْ كُلِّ شَيْءٍ )',
          theker_header: 'أذكار بعد الصلاة',
        ));
        addTheker(Theker(
            theker_text:
                '''لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير. ''',
            theker_number: 10,
            theker_reward: 'بعد صلاتي الفجر والمغرب',
            theker_guide:
                'عن أبي ذر ـ رضي الله عنه ـ أن رسول الله صلى الله عليه وسلم قال: من قال في دبر صلاة الفجر وهو ثان رجليه قبل أن يتكلم لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير عشر مرات كتب الله له عشر حسنات، ومحا عنه عشر سيئات، ورفع له عشر درجات، وكان يومه ذلك كله في حرز من كل مكروه، وحرس من الشيطان، ولم ينبغ لذنب أن يدركه في ذلك اليوم إلا الشرك بالله تعالى. /n وعن عمارة بن شبيب السبائي ـ رضي الله عنه ـ قال: قال رسول الله صلى الله عليه وسلم: من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير عشر مرات على إثر المغرب بعث الله له مسلحة ـ أي حرسا ـ يحفظونه من الشيطان حتى يصبح، وكتب الله له بها عشر حسنات موجبات، ومحا عنه عشر سيئات موبقات، وكانت له بعدل عشر رقبات مؤمنات.',
            theker_header: 'أذكار بعد الصلاة'));

        /// أذكار النوم
        addTheker(Theker(
          theker_text: '''اللهم باسمك أموت وأحيا.''',
          theker_guide: '',
          theker_header: 'أذكار النوم',
          theker_number: 1,
          theker_reward:
              'أن رسولَ اللهِ صلى الله عليه وسلم كان إذا أخذَ مضجعهُ وضعَ كفهُ اليُمنى تحتَ خدهِ الأيمنَ ، وقال : ربِّ قنِي عذابكَ يومَ تبعثُ عبادكَ',
        ));
        addTheker(Theker(
          theker_text:
              '''آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. ''',
          theker_reward: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.',
          theker_header: 'أذكار النوم',
          theker_number: 1,
          theker_guide:
              'عن النبيِّ ﷺ قال:"من قرأ بالآيتَيْنِ مِنْ آخِرِ سُورةِ البقَرةِ فِي لَيْلَةٍ كَفَتَاهُ" ',
        ));
        addTheker(Theker(
          theker_text:
              '''قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.''',
          theker_number: 3,
          theker_reward:
              'ثلاث مرات بعد صلاتي الفجروالمغرب، ومرة بعد الصلوات الأخرى',
          theker_guide:
              'ديث عائشة -رضي الله عنها-: أنَّ النبي ﷺ كان إذا أوى إلى فراشه كلَّ ليلةٍ جمع كفَّيه، ثم نفث فيهما، فقرأ فيهما: قُلْ هُوَ اللَّهُ أَحَدٌ [الإخلاص]، وقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ [الفلق]، وقُلْ أَعُوذُ بِرَبِّ النَّاسِ [الناس]، ثم يمسح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه وما أقبل من جسده، يفعل ذلك ثلاث مرَّاتٍ',
          theker_header: 'أذكار النوم',
        ));
        addTheker(Theker(
          theker_text:
              '''قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ..''',
          theker_number: 3,
          theker_reward:
              'ثلاث مرات بعد صلاتي الفجروالمغرب، ومرة بعد الصلوات الأخرى',
          theker_guide:
              'ديث عائشة -رضي الله عنها-: أنَّ النبي ﷺ كان إذا أوى إلى فراشه كلَّ ليلةٍ جمع كفَّيه، ثم نفث فيهما، فقرأ فيهما: قُلْ هُوَ اللَّهُ أَحَدٌ [الإخلاص]، وقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ [الفلق]، وقُلْ أَعُوذُ بِرَبِّ النَّاسِ [الناس]، ثم يمسح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه وما أقبل من جسده، يفعل ذلك ثلاث مرَّاتٍ',
          theker_header: 'أذكار النوم',
        ));
        addTheker(Theker(
          theker_text:
              'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ',
          theker_number: 3,
          theker_reward:
              'ثلاث مرات بعد صلاتي الفجروالمغرب، ومرة بعد الصلوات الأخرى',
          theker_guide:
              'ديث عائشة -رضي الله عنها-: أنَّ النبي ﷺ كان إذا أوى إلى فراشه كلَّ ليلةٍ جمع كفَّيه، ثم نفث فيهما، فقرأ فيهما: قُلْ هُوَ اللَّهُ أَحَدٌ [الإخلاص]، وقُلْ أَعُوذُ بِرَبِّ الْفَلَقِ [الفلق]، وقُلْ أَعُوذُ بِرَبِّ النَّاسِ [الناس]، ثم يمسح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه وما أقبل من جسده، يفعل ذلك ثلاث مرَّاتٍ',
          theker_header: 'أذكار النوم',
        ));
        addTheker(Theker(
            theker_text:
                '''اللهم ربَّ السَّماوات، وربَّ الأرض، وربَّ العرش العظيم، ربنا وربّ كل شيءٍ، فالق الحبِّ والنَّوى، ومُنزل التَّوراة والإنجيل والفُرقان، أعوذ بك من شرِّ كل شيءٍ أنت آخذٌ بناصيته، اللهم أنت الأول، فليس قبلك شيءٌ، وأنت الآخر، فليس بعدك شيءٌ، وأنت الظَّاهر، فليس فوقك شيءٌ، وأنت الباطن، فليس دونك شيءٌ، اقضِ عنا الدَّينَ، وأغننا من الفقر''',
            theker_guide:
                'عن سهيلٍ قال: كان أبو صالحٍ يأمرنا إذا أراد أحدُنا أن ينام أن يضطجع على شقِّه الأيمن، ثم يقول: اللهم ربَّ السَّماوات، وربَّ الأرض، وربَّ العرش العظيم، ربنا وربّ كل شيءٍ، فالق الحبِّ والنَّوى، ومُنزل التَّوراة والإنجيل والفُرقان، أعوذ بك من شرِّ كل شيءٍ أنت آخذٌ بناصيته، اللهم أنت الأول، فليس قبلك شيءٌ، وأنت الآخر، فليس بعدك شيءٌ، وأنت الظَّاهر، فليس فوقك شيءٌ، وأنت الباطن، فليس دونك شيءٌ، اقضِ عنا الدَّينَ، وأغننا من الفقر',
            theker_header: 'أذكار النوم',
            theker_number: 1,
            theker_reward: ''));
        addTheker(Theker(
          theker_text:
              'اللهُمَّ أَسلَمتُ نَفسِي إِلَيك وَوجهتُ وَجهِي إِلَيك، وَفَوَّضْتُ أّمرِي إِلَيك، رغبةَ ورهبةَ إليك، لا مَلجَأَ ولا مَنْجَى مِنكَ إلا إِليك، آمنتُ بِكِتَابِك الذي أَنْزَلت، وَنَبِيك الذي أرسلتَ',
          theker_number: 1,
          theker_reward:
              'إن مات يموت على الفطرة أي على دين الإسلام وسنة خير الأنام',
          theker_guide:
              'عن النَّبيِّ صلَّى اللهُ عليه وسلَّم أنَّه كان إذا أخَذ مَضجَعَه قال: ( اللَّهمَّ إنِّي أسلَمْتُ نفسي إليك ووجَّهْتُ وجهي إليك وفوَّضْتُ أمري إليك رغبةً ورهبةً إليك لا ملجأَ منك إلَّا إليك ).',
          theker_header: 'أذكار النوم',
        ));
        addTheker(Theker(
          theker_text: 'اللهُمَ قِني عَذَابَك يَوم تَبعَثُ عِبادك',
          theker_number: 3,
          theker_reward: '',
          theker_guide:
              'عن أم المؤمنين حفصة رضي الله عنها أن رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم، كان إذا أراد أن يَرْقُدَ وضع يدَه اليمنى تحتَ خَدِّهِ ثم يقول : اللهم قِنِي عذابَك يوم تبعثُ عبادَك - ثلاثَ مِرارٍ .',
          theker_header: 'أذكار النوم',
        ));
        addTheker(Theker(
          theker_text:
              'اللهُمَ خلقتَ نفسي وأنت! تتوفاها، لكَ مماتها ومَحياهَا، إِن أَحييتَها فَاحفَظها، وإن أَمتَّها فَاغفرِ لَها، اللهم إِني أَسألُكَ العَافية',
          theker_number: 1,
          theker_reward: '',
          theker_guide:
              'عن ابن عمر رضي الله عنها قال أنه أمر رجلاً إذا أخذ مضجعه أن يقول:(اللهم خلقت نفسي وأنت تتوفاها، لك ممتاتها ومحياها، إن أحييتها فاحفظها، وإن أمتها فاغفر لها، اللهم إني أسألك العافية)، قال ابن عمر: سمعته من رسول الله صلى الله عليه وسلم',
          theker_header: 'أذكار النوم',
        ));
        addTheker(Theker(
            theker_text:
                'الحمدللهِ الذي أطعَمَنا وسَقَانَا، وكَفَانَا فكم ممن لا كَافِي لَهُ وَلا مُؤوِي',
            theker_guide:
                'عن أنسِ بن مالكٍ عن رضي الله عنهُ: أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم كان إذا أوى إلى فراشِه قال: ( الحمدُ للهِ الَّذي أطعَمنا وسقانا وكفانا فكم ممَّن لا كافيَ له ولا مُؤويَ )',
            theker_header: 'أذكار النوم',
            theker_number: 1,
            theker_reward: ''));
      
        /// أذكار الاستيقاظ
        addTheker(Theker(
          theker_reward: '',
          theker_guide:
              'حديث أبي هريرة رضي الله عنه قال صلى الله عليه وسلم: فإذا استيقظ فليقل الحمد الله الذي عافاني في جسدي ورد علي روحي وأذن لي بذكره. ',
          theker_header: 'أذكار الاستيقاظ',
          theker_number: 1,
          theker_text:
              '''الحمدلله الذي عافاني في جسدي، ورد إلي روحي، وأذن لي بذكره.''',
        ));
        addTheker(Theker(
          theker_reward: '',
          theker_guide:
              'انَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا أوَى إلى فِرَاشِهِ قَالَ: اللَّهُمَّ باسْمِكَ أحْيَا وأَمُوتُ، وإذَا أصْبَحَ قَالَ: الحَمْدُ لِلَّهِ الذي أحْيَانَا بَعْدَ ما أمَاتَنَا، وإلَيْهِ النُّشُورُ.',
          theker_header: 'أذكار الاستيقاظ',
          theker_number: 1,
          theker_text: '''الحمدلله الذي أحيانا بعد ما أماتنا. وإليه النشور.''',
        ));
      } else {
        print('MAIN theker data added before!');
      }
    } else {
      print('MAIN data added before');
    }
}
